БухЭксп/Catalogs/ТСПИоТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТСПИоТ</Name>
			<Comment>Технические средства передачи информации о товаре </Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭкземпляра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип ТО ПИоТ</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТСПИоТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальноеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКДрайверу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьДанныхЭкземпляра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньЛога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиСервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроксиПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗПорт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗПользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсключитьПроверкуКорневыхСертификатов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияAPI</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииAPIТСПИоТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМЧЗПроверкаОтключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресУзлаГИСМТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбновленияТокенаЛМЧЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтветаГИСМТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалПосылкиСобытийЭксплуатации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОИСМПроверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОИСМТаймаутПроверки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОИСМПоведениеЕслиОтветНеполучен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлатформыКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Enums/ВерсииAPIТСПИоТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВерсииAPIТСПИоТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>V1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>V2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>V3</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/ТСПИоТ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	СозданиеНовогоЭлемента = Объект.Ссылка = Справочники.ТСПИоТ.ПустаяСсылка();
	
	Если НЕ ЗначениеЗаполнено(Объект.ИдентификаторЭкземпляра) Тогда
		Объект.ИдентификаторЭкземпляра = Строка(Новый УникальныйИдентификатор());
	КонецЕсли;

	Если ОбщегоНазначенияБПО.ЭтоМобильнаяПлатформа() Тогда
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Наименование);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ФискальноеУстройство);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Тип);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПутьКДрайверу);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПутьДанныхЭкземпляра);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.УровеньЛога);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиСервер);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПорт);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПользователь);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПроксиПароль);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗАдрес);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗПорт);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗПользователь);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЛМЧЗПароль);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ЗащищенноеСоединение);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Сервер);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Порт);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ОбменНаСервере);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.Таймаут);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ);
		ОбщегоНазначенияБПО.ПодготовитьЭлементУправления(Элементы.ПредставлениеПроксиСервера);
	КонецЕсли;
	
	ОбменНаСервере = ?(Объект.ОбменНаСервере, 0, 1);
	
	ДоступностьИспользованияВнутреннегоТСПИоТ = ОбщегоНазначенияБПО.ИспользуетсяТСПИоТ() И ОбщегоНазначенияБПОКлиентСервер.Доступен1СПИоТ();
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	Если Не СозданиеНовогоЭлемента Тогда
		Элементы.Тип.Доступность = НЕ (ЗначениеЗаполнено(Объект.ФискальноеУстройство)) И ДоступностьИспользованияВнутреннегоТСПИоТ;
	КонецЕсли;
	
	Элементы.ЧестныйЗнак.Доступность = НЕ Объект.ЛМЧЗПроверкаОтключена;  
	Элементы.ОИСМНастройки.Доступность = Объект.ОИСМПроверка;  
	
	Если МенеджерОборудованияТСПИоТ.ПрохожденияСертификацииТСПИоТ() Тогда   
		Элементы.ЛМЧЗПроверкаОтключена.Видимость = Ложь;
		Элементы.ОИСМПроверка.Видимость = Ложь;
	КонецЕсли; 
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
#Если НЕ ВебКлиент Тогда     
	РабочийКаталог = РабочийКаталогДанныхПользователя();
#Иначе     
	РабочийКаталог = "";
#КонецЕсли
	
	Если СозданиеНовогоЭлемента Тогда
		УстановитьПутиПоУмолчаниюСервер();   
	Иначе
		ПроверкаИнициализацияПИоТ = МенеджерОборудованияКлиент.ПроверкаИнициализацияПИоТПройдена(Объект.ФискальноеУстройство);    
		Если ПроверкаИнициализацияПИоТ Тогда   
			ЭтаФорма.КоманднаяПанель.Видимость = Ложь;
			Элементы.ВнутреннийТСПИоТ.ТолькоПросмотр = Истина;
			Элементы.Наименование.Доступность = Ложь;          
			Элементы.ФискальноеУстройство.Доступность = Ложь;  
			Элементы.ЭкземплярЗапущен.Видимость = Истина;
		КонецЕсли;           
		Если ПустаяСтрока(Объект.ТипПлатформыКлиента) Тогда
			Объект.ТипПлатформыКлиента = Строка(ОбщегоНазначенияБПОКлиент.ТипПлатформыКлиента());
		КонецЕсли;           
		
		ПараметрыОперации = ОборудованиеЧекопечатающиеУстройстваКлиент.ПараметрыАутентификацииПользователя(); 
		ПараметрыОперации.Кассир     = ТекущийПользователь;
		ПараметрыОперации.КассирИНН  = "";         
		ПараметрыОперации.Успешность = Истина;   
		ОборудованиеЧекопечатающиеУстройстваКлиент.АутентификациюПользователяПИоТ(УникальныйИдентификатор,
			Объект.ФискальноеУстройство, ПараметрыОперации);
	КонецЕсли;
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ИмяСобытия = "Запись_НастройкиПодключенияЛокальныхМодулейИСМП" Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	ПриИзмененииФискальногоУстройстваНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолученыДанныеТСПИоТ И ПроверитьКорректностьЗаполненияНастроек() Тогда
		ВыполнитьПроверкуПодключенияНачало();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СозданиеНовогоЭлемента = Ложь;
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НастройкаЛокальногоМодуляПоДаннымТСПИоТ = Неопределено Тогда
		
		МодульИнтеграцияТСПИоТ = ОбщегоНазначенияБПО.ОбщийМодуль("ИнтеграцияТСПИоТВызовСервера");
		МодульИнтеграцияТСПИоТ.ЗафиксироватьНастройкиЛокальногоМодуляИТокенПоДаннымТСПИоТ(НастройкаЛокальногоМодуляПоДаннымТСПИоТ, ТекущийОбъект.Ссылка);
		
	КонецЕсли;
	
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(ЭтотОбъект);
	УстановитьНаименованиеЭкземпляраТСПИоТ();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗащищенноеСоединениеПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура СерверПодключенияПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПортПодключенияПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменНаСервереПриИзменении(Элемент)
	
	Если ОбменНаСервере = 1 Тогда
		Объект.ОбменНаСервере = Ложь;
	Иначе
		Объект.ОбменНаСервере = Истина;
	КонецЕсли;
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаНеВыполненаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаНеВыполняласьОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаФННеВыполненаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПроверкаИНННеВыполненаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ОбработатьНавигационнуюСсылку(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ФискальноеУстройсвоПриИзменении(Элемент)
	
	УстановитьДоступностьИОбновитьСписокТиповПИоТ(ЭтотОбъект);
	
	ПриИзмененииФискальногоУстройстваНаСервере();
	УстановитьНаименованиеЭкземпляраТСПИоТ();
	
	ОтобразитьНаФормеОтличияНастроекТСПИоТ();
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПодключенияЛМЧЗВнешнийПИоТНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	Отбор               = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	
	Если ЗначениеЗаполнено(ВерсияБГосИС)
		И СтрРазделить(ВерсияБГосИС, ".")[0] = "3"
		И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "3.0.8.1") >= 0
		
		Или ЗначениеЗаполнено(ВерсияБГосИС)
		И СтрРазделить(ВерсияБГосИС, ".")[0] = "2"
		И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "2.0.8.1") >= 0 Тогда
		
		Если НастройкаЛокальногоМодуляПоДаннымТСПИоТ <> Неопределено Тогда
			
			СтруктураЗаполнения.Вставить("ТСПИоТ", Объект.Ссылка);
			Отбор.Вставить("ТСПИоТ",               Объект.Ссылка);
			
		Иначе
			
			СтруктураЗаполнения.Вставить("ТСПИоТ", ПредопределенноеЗначение("Справочник.ТСПИоТ.ПустаяСсылка"));
			Отбор.Вставить("ТСПИоТ",               ПредопределенноеЗначение("Справочник.ТСПИоТ.ПустаяСсылка"));
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НастройкаЛокальногоМодуля <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, НастройкаЛокальногоМодуля);
		ЗаполнитьЗначенияСвойств(Отбор,               НастройкаЛокальногоМодуля);
		
	КонецЕсли;
	
	ПослеЗакрытияФормыНастройкиПодключения = Новый ОписаниеОповещения("ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля", ЭтотОбъект);
	
	МодульОбменДанными = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
	МодульОбменДанными.ОткрытьФормуЗаписиРегистраСведенийПоОтбору(Отбор,
		СтруктураЗаполнения,
		"НастройкиПодключенияЛокальныхМодулейИСМП",
		ЭтотОбъект,
		,,
		ПослеЗакрытияФормыНастройкиПодключения);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПодключенияЛМЧЗВнутреннийПИоТНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаполнения = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	Отбор               = Новый Структура("Организация, РабочееМесто, Приоритет", Организация, РабочееМесто, 0);
	
	Если ЗначениеЗаполнено(ВерсияБГосИС)
		И СтрРазделить(ВерсияБГосИС, ".")[0] = "3"
		И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "3.0.8.1") >= 0
		
		Или ЗначениеЗаполнено(ВерсияБГосИС)
		И СтрРазделить(ВерсияБГосИС, ".")[0] = "2"
		И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "2.0.8.1") >= 0 Тогда
		
		СтруктураЗаполнения.Вставить("ТСПИоТ", Объект.Ссылка);
		Отбор.Вставить("ТСПИоТ",               Объект.Ссылка);
		
	КонецЕсли;
	
	Если НастройкаЛокальногоМодуля <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, НастройкаЛокальногоМодуля);
		ЗаполнитьЗначенияСвойств(Отбор,               НастройкаЛокальногоМодуля);
		
	КонецЕсли;
	
	ПослеЗакрытияФормыНастройкиПодключения = Новый ОписаниеОповещения("ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля", ЭтотОбъект);
	
	МодульОбменДанными = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОбменДаннымиКлиент");
	МодульОбменДанными.ОткрытьФормуЗаписиРегистраСведенийПоОтбору(Отбор,
		СтруктураЗаполнения,
		"НастройкиПодключенияЛокальныхМодулейИСМП",
		ЭтотОбъект,
		,,
		ПослеЗакрытияФормыНастройкиПодключения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПроксиСервераНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЕстьПодсистемаБСП Тогда
		Возврат;
	КонецЕсли;
	
	#Если ВебКлиент Тогда
	ПоказатьПредупреждение(, НСтр("ru = 'В веб-клиенте параметры прокси-сервера необходимо задавать в настройках браузера.'"));
	Возврат;
	#КонецЕсли
	
	ИмяОткрываемойФормы = "ОбщаяФорма.ПараметрыПроксиСервера";
	ПослеЗакрытияОкнаНастройкаПроксиСервера = Новый ОписаниеОповещения("ПослеЗакрытияОкнаНастройкаПроксиСервера", ЭтотОбъект);
	
	ОткрытьФорму(ИмяОткрываемойФормы, Новый Структура("НастройкаПроксиНаКлиенте", Истина),,,,, ПослеЗакрытияОкнаНастройкаПроксиСервера);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверятьКорневыеСертификатыВнешнийПИоТПриИзменении(Элемент)
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьНастройкиПодключения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсияAPIПриИзменении(Элемент)
	
	ПроверитьНастройкиПодключения();
	ОбновитьПодсказкуВерсииAPI(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛМЧЗПроверкаОтключенаПриИзменении(Элемент)
	
	Элементы.ЧестныйЗнак.Доступность = НЕ Объект.ЛМЧЗПроверкаОтключена;
	
КонецПроцедуры

&НаКлиенте
Процедура ОИСМПроверкаПриИзменении(Элемент)
	
	Элементы.ОИСМНастройки.Доступность = Объект.ОИСМПроверка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПутьДрайверуПоУмолчанию(Команда)
	
	УстановитьПутьДрайверуПоУмолчаниюСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПутьЭкземпляраПоУмолчанию(Команда)
	
	УстановитьПутьЭкземпляраПоУмолчаниюСервер();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроверкаНастройкиПодключенияТСПИоТ

&НаКлиенте
Процедура ПроверитьНастройкиПодключения(ЗаполнитьНастройкиПринудительно = Ложь)
	
	Если Не Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внешний") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьКорректностьЗаполненияНастроек() Тогда
		ПодключитьОбработчикОжидания("ВыполнитьПроверкуПодключенияНачало", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьЗаполненияНастроек()
	
	Возврат ЗначениеЗаполнено(Объект.ФискальноеУстройство)
		И ЗначениеЗаполнено(Объект.Сервер)
		И ЗначениеЗаполнено(Объект.Порт);
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПроверкуПодключенияНачало() Экспорт
	
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
	
	ЗапуститьПроверкуПодключения();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьПодсказкуВерсииAPI(Форма)
	
	Если Не ЗначениеЗаполнено(Форма.Объект.ВерсияAPI)
		Или Форма.Объект.ВерсияAPI = ПредопределенноеЗначение("Перечисление.ВерсииAPIТСПИоТ.V1") Тогда
		Форма.Элементы.ВерсияAPI.Подсказка = НСтр("ru = 'Рекомендуем переключиться на актуальную версию формата.'");
		Форма.Элементы.ГруппаВерсияAPI.ЦветФона = Форма.ЦветПодсказки;
	Иначе
		Форма.Элементы.ГруппаВерсияAPI.ЦветФона = Новый Цвет();
		Форма.Элементы.ВерсияAPI.Подсказка = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДлительныеПроцедуры

&НаКлиенте
Процедура ЗапуститьПроверкуПодключения()
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внешний") Тогда
		Возврат;
	КонецЕсли;
	
	ТекстОшибкиПодключенияТСПИоТ = "";
	Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполняется;
	
	МодульОбщегоНазначенияИСМПКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОбщегоНазначенияИСМПКлиентСервер");
	ПараметрыПодключения = МодульОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ();
	ПараметрыПодключения.Сервер                                = Объект.Сервер;
	ПараметрыПодключения.ЗащищенноеСоединение                  = Объект.ЗащищенноеСоединение;
	ПараметрыПодключения.Порт                                  = Объект.Порт;
	ПараметрыПодключения.ИсключитьПроверкуКорневыхСертификатов = Объект.ИсключитьПроверкуКорневыхСертификатов;
	
	Если ПараметрыПодключения.Свойство("ВерсияAPI") Тогда
		ПараметрыПодключения.ВерсияAPI = Объект.ВерсияAPI;
	КонецЕсли;
	
	ПараметрыОбработки = Новый Структура();
	ПараметрыОбработки.Вставить("ПараметрыПодключения",   ПараметрыПодключения);
	ПараметрыОбработки.Вставить("НеВыводитьОкноОжидания", Истина);
	
	ПослеВыполненияОбновления = Новый ОписаниеОповещения("ПослеВыполненияПроверкиНастройкиТСПИоТ", ЭтотОбъект);
	
	МодульИнтерфейсИСМПОбщегоНазначенияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ИнтерфейсИСМПОбщегоНазначенияКлиент");
	ПараметрыЗапроса                          = МодульИнтерфейсИСМПОбщегоНазначенияКлиент.ПараметрыЗапросаДанных();
	ПараметрыЗапроса.ОповещениеОЗавершении    = ПослеВыполненияОбновления;
	ПараметрыЗапроса.УникальныйИдентификатор  = УникальныйИдентификатор;
	ПараметрыЗапроса.Параметры                = ПараметрыОбработки;
	ПараметрыЗапроса.ВыполнениеНаКлиенте      = Не Объект.ОбменНаСервере;
	
	МодульИнтерфейсИСМПОбщегоНазначенияКлиент.ПолучитьДанныеНастройкиТСПИоТ(ПараметрыЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияПроверкиНастройкиТСПИоТ(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ЕстьОшибки Тогда
		
		СформироватьТекстРасширеннойОшибкиПодключения(Результат.ТекстОшибки);
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнена;
		
	Иначе
		
		Если Результат.Свойство("Результат") И ТипЗнч(Результат.Результат) = Тип("Структура") Тогда
			
			Если ОбщегоНазначенияБПОКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат.Результат, "НастройкиЭкземпляраТСПИоТ")
				И Результат.Результат.НастройкиЭкземпляраТСПИоТ <> Неопределено Тогда
				
				ПолученыДанныеТСПИоТ                     = Истина;
				НастройкиЭкземпляраТСПИоТ                = Результат.Результат.НастройкиЭкземпляраТСПИоТ;
				НомерФискальногоНакопителяПоДаннымТСПИоТ = НастройкиЭкземпляраТСПИоТ.НомерФискальногоНакопителя;
				ИННПоДаннымТСПИоТ                        = НастройкиЭкземпляраТСПИоТ.ИНН;
				
				Если НастройкиЭкземпляраТСПИоТ.Свойство("ДанныеНастройкиЛокальногоМодуля") И НастройкиЭкземпляраТСПИоТ.ДанныеНастройкиЛокальногоМодуля.Подключено Тогда
					
					НастроеноПодключениеЛМЧЗ                = Истина;
					НастройкаЛокальногоМодуляПоДаннымТСПИоТ = НастройкиЭкземпляраТСПИоТ.ДанныеНастройкиЛокальногоМодуля;
					
					Если Не Объект.Ссылка.Пустая() Тогда
						
						МодульИнтеграцияТСПИоТ = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ИнтеграцияТСПИоТВызовСервера");
						МодульИнтеграцияТСПИоТ.ЗафиксироватьНастройкиЛокальногоМодуляИТокенПоДаннымТСПИоТ(НастройкаЛокальногоМодуляПоДаннымТСПИоТ, Объект.Ссылка);
						
					КонецЕсли;
					
				КонецЕсли;
				
				УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
				ОтобразитьНаФормеОтличияНастроекТСПИоТ();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИнтерфейсныеПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ЦветВажногоТекста         = Новый Цвет(255, 0, 0);
	ЦветНеактивнойГиперссылки = Новый Цвет(200, 200, 200);
	ЦветПодсказки             = ЦветаСтиля.ЦветФонаПодсказки;
	ШрифтВажногоТекста        = Новый Шрифт(,, Истина);
	
	ЕстьПодсистемаБСП   = ОбщегоНазначенияБПО.ИспользуетсяБСП();
	ЕстьПодсистемаГосИС = ОбщегоНазначенияБПО.ИспользуетсяГосИС();
	
	Если ЕстьПодсистемаГосИС Тогда
		
		МодульОбщегоНазначенияИС = ОбщегоНазначенияБПО.ОбщийМодуль("ОбщегоНазначенияИС");
		ВерсияБГосИС             = МодульОбщегоНазначенияИС.ВерсияБиблиотеки();
		
	КонецЕсли;
	
	УстановитьДоступностьИОбновитьСписокТиповПИоТ(ЭтотОбъект);
	ОбновитьДанныеПриУстановкеККТ();

	УстановитьОтображениеДанныхПрокси();
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	ОбновитьПодсказкуВерсииAPI(ЭтотОбъект);
	
	УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНавигационнуюСсылку(Знач НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПроверитьПодключениеТСПИоТ" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Если ПроверитьКорректностьЗаполненияНастроек() Тогда
			ВыполнитьПроверкуПодключенияНачало();
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Укажите настройки подключения и попробуйте снова.'"));
		КонецЕсли;
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СкопироватьНомерФискальногоНакопителя" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоместитьТекстВБуфераОбмена(НомерФискальногоНакопителяПоДаннымТСПИоТ);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СкопироватьИННОрганизации" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоместитьТекстВБуфераОбмена(ИННПоДаннымТСПИоТ);
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ПоказатьПолныйТекстОшибки" Тогда
		
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, ТекстОшибкиПодключенияТСПИоТ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаКлиенте
Асинх Процедура ПоместитьТекстВБуфераОбмена(ТекстДляКопирования)
	
	Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
		
		ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Текст;
		
		Если Ждать СредстваБуфераОбмена.ПоддерживаетсяФорматДанных(ФорматДанных) Тогда
			
			ПомещаемыеДанные = Новый ЭлементБуфераОбмена(ФорматДанных, ТекстДляКопирования);
			ЗавершеноКопирование = Ждать СредстваБуфераОбмена.ПоместитьДанныеАсинх(ПомещаемыеДанные);
			
			Если ЗавершеноКопирование Тогда
				ПоказатьОповещениеПользователя(НСтр("ru = 'Текст скопирован в буфер обмена'"));
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПутиПоУмолчаниюСервер()
	
	Пути = МенеджерОборудованияТСПИоТ.СформироватьПутиВнутреннегоПИоТ(Объект.ИдентификаторЭкземпляра, РабочийКаталог);
	Объект.ПутьКДрайверу = Пути.ПутьКДрайверу; 
	Объект.ПутьДанныхЭкземпляра = Пути.ПутьДанныхЭкземпляра;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПутьДрайверуПоУмолчаниюСервер()
	
	Пути = МенеджерОборудованияТСПИоТ.СформироватьПутиВнутреннегоПИоТ(Объект.ИдентификаторЭкземпляра, РабочийКаталог);
	Объект.ПутьКДрайверу = Пути.ПутьКДрайверу;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПутьЭкземпляраПоУмолчаниюСервер()
	
	Пути = МенеджерОборудованияТСПИоТ.СформироватьПутиВнутреннегоПИоТ(Объект.ИдентификаторЭкземпляра, РабочийКаталог);
	Объект.ПутьДанныхЭкземпляра = Пути.ПутьДанныхЭкземпляра;
	
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьДоступностьЭлементовВЗависимостиОтВидаПИоТ(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ЭтоВнутреннийПИоТ = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внутренний1С"));
	ЭтоВнешнийПИоТ    = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внешний"));
	
	Элементы.ВнутреннийТСПИоТ.Видимость          = ЭтоВнутреннийПИоТ;
	Элементы.ВнешнийТСПИоТ.Видимость             = ЭтоВнешнийПИоТ;
	Элементы.ФискальноеУстройство.ТолькоПросмотр = (ЭтоВнешнийПИоТ Или ЭтоВнутреннийПИоТ) И Не Форма.СозданиеНовогоЭлемента; 
	Элементы.ПериодОбновленияТокенаЛМЧЗГруппа1.Видимость = ЭтоВнутреннийПИоТ;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПриУстановкеККТ()
	
	Если Не ЗначениеЗаполнено(Объект.ФискальноеУстройство) Тогда
		
		Организация  = Неопределено;
		РабочееМесто = Неопределено;
		Возврат;
		
	КонецЕсли;
	
	СтруктураРеквизитовПодключаемогоОборудования = ОбщегоНазначенияБПО.ЗначенияРеквизитовОбъекта(Объект.ФискальноеУстройство, "Организация, РабочееМесто");
	
	Организация  = СтруктураРеквизитовПодключаемогоОборудования.Организация;
	РабочееМесто = СтруктураРеквизитовПодключаемогоОборудования.РабочееМесто;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьНаФормеОтличияНастроекТСПИоТ()
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внешний") Тогда
		Возврат;
	КонецЕсли;
	
	ОтличияНастроек = ПроверитьОтличияНастроекТСПИоТ();
	
	Если Не ЗначениеЗаполнено(ИННПоДаннымТСПИоТ) И Не ЗначениеЗаполнено(НомерФискальногоНакопителяПоДаннымТСПИоТ) Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаНеВыполнялась;
		
	ИначеЕсли ОтличияНастроек.ЕстьОтличияНомераФН Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
		Элементы.СтраницыРезультатНастройки.ТекущаяСтраница  = Элементы.СтраницаНомерФННеСовпадаетСНастройками;
		
		СформироватьНадписьОтличияФНОтНастроекТСПИоТ();
		
	ИначеЕсли ОтличияНастроек.ЕстьОтличияИНН Тогда
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
		Элементы.СтраницыРезультатНастройки.ТекущаяСтраница  = Элементы.СтраницаИНННеСовпадаетСНастройками;
		
		СформироватьНадписьОтличияИННОтНастроекТСПИоТ();
		
	Иначе
		
		Элементы.СтраницыПроверкаПодключения.ТекущаяСтраница = Элементы.СтраницаПроверкаВыполнена;
		Элементы.СтраницыРезультатНастройки.ТекущаяСтраница  = Элементы.СтраницаНастройкаЗавершенаКорректно;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьОтличияНастроекТСПИоТ()
	
	СтруктураВозврата = Новый Структура();
	
	СтруктураВозврата.Вставить("ЕстьОтличияНомераФН", НомерФискальногоНакопителяПоДаннымТСПИоТ <> НомерФискальногоНакопителя);
	СтруктураВозврата.Вставить("ЕстьОтличияИНН",      ЗначениеЗаполнено(ИННОрганизации)
		И ЗначениеЗаполнено(ИННПоДаннымТСПИоТ)
		И ОбщегоНазначенияБПОКлиентСервер.СтрокаВЧисло(ИННПоДаннымТСПИоТ) <> ОбщегоНазначенияБПОКлиентСервер.СтрокаВЧисло(ИННОрганизации));
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура СформироватьНадписьОтличияФНОтНастроекТСПИоТ()
	
	МассивСтрок = Новый Массив;
	
	СтрокаВажныйТекст = Новый ФорматированнаяСтрока(НСтр("ru = 'Номер фискального накопителя, указанного при настройке ТС ПИоТ, не совпадает с указанным'"),, ЦветВажногоТекста);
	СтрокаНомерФН     = Новый ФорматированнаяСтрока(Формат(НомерФискальногоНакопителяПоДаннымТСПИоТ, "ЧРГ=; ЧГ=;"),,,, "СкопироватьНомерФискальногоНакопителя");
	
	МассивСтрок.Добавить(СтрокаВажныйТекст);
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(НСтр("ru = 'Номер ФН по данным ТС ПИоТ -'"));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(СтрокаНомерФН);
	
	Элементы.НадписьПроверкаФННеВыполнена.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНадписьОтличияИННОтНастроекТСПИоТ()
	
	МассивСтрок = Новый Массив;
	
	СтрокаВажныйТекст = Новый ФорматированнаяСтрока(НСтр("ru = 'ИНН владельца ККТ не совпадает с указанным в настройках ТС ПИоТ.'"),, ЦветВажногоТекста);
	СтрокаИНН         = Новый ФорматированнаяСтрока(Формат(ИННПоДаннымТСПИоТ, "ЧРГ=; ЧГ=;"),,,, "СкопироватьИННОрганизации");
	
	МассивСтрок.Добавить(СтрокаВажныйТекст);
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(НСтр("ru = 'ИНН по данным ТС ПИоТ -'"));
	МассивСтрок.Добавить(" ");
	МассивСтрок.Добавить(СтрокаИНН);
	
	Элементы.НадписьПроверкаИНННеВыполнена.Заголовок = Новый ФорматированнаяСтрока(МассивСтрок);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииФискальногоУстройстваНаСервере()
	
	Если ОбщегоНазначенияБПО.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройства = ОбщегоНазначенияБПО.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройства");
		ПараметрыРегистрации = МодульОборудованиеЧекопечатающиеУстройства.ПараметрыРегистрацииУстройства(Объект.ФискальноеУстройство);
		Если ПараметрыРегистрации.Свойство("ЗаводскойНомерФН") И ЗначениеЗаполнено(ПараметрыРегистрации.ЗаводскойНомерФН) Тогда
			НомерФискальногоНакопителя = ПараметрыРегистрации.ЗаводскойНомерФН;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДанныеПриУстановкеККТ();
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	МодульРаботаСКонтрагентамиИСВызовСервера = ОбщегоНазначенияБПО.ОбщийМодуль("РаботаСКонтрагентамиИСВызовСервера");
	ИННОрганизации                           = МодульРаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(Организация).ИНН;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименованиеЭкземпляраТСПИоТ()
	
	Если Не ЗначениеЗаполнено(Объект.Тип)
		Или Не ЗначениеЗаполнено(Объект.ФискальноеУстройство) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВнутреннийПИоТ = (Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыТСПИоТ.Внутренний1С"));
	
	Объект.Наименование = ?(ЭтоВнутреннийПИоТ,
		СтрШаблон(НСтр("ru = '1С: ТС ПИоТ для %1'"), Строка(Объект.ФискальноеУстройство)),
		СтрШаблон(НСтр("ru = 'Внешний ПИоТ для %1'"), Строка(Объект.ФискальноеУстройство)));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьИОбновитьСписокТиповПИоТ(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.Тип.Доступность = ЗначениеЗаполнено(Объект.ФискальноеУстройство) И Форма.ДоступностьИспользованияВнутреннегоТСПИоТ;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеДанныхПрокси()
	
	ОтображатьДанныеПрокси = Не ЕстьПодсистемаБСП;
	
	Элементы.Прокси.Видимость                     = ОтображатьДанныеПрокси;
	Элементы.ПредставлениеПроксиСервера.Видимость = Не ОтображатьДанныеПрокси;
	
	Если Не ЕстьПодсистемаБСП Тогда
		Возврат;
	КонецЕсли;
	
	МодульПолучениеФайловИзИнтернета = ОбщегоНазначенияБПО.ОбщийМодуль("ПолучениеФайловИзИнтернета");
	НастройкаПроксиНаКлиенте         = МодульПолучениеФайловИзИнтернета.НастройкиПроксиНаКлиенте();
	
	ИспользоватьПрокси             = Истина;
	ИспользоватьСистемныеНастройки = Истина;
	
	Если ТипЗнч(НастройкаПроксиНаКлиенте) = Тип("Соответствие") Тогда
		
		ИспользоватьПрокси             = НастройкаПроксиНаКлиенте.Получить("ИспользоватьПрокси");
		ИспользоватьСистемныеНастройки = НастройкаПроксиНаКлиенте.Получить("ИспользоватьСистемныеНастройки");
		
		Если ИспользоватьПрокси И НЕ ИспользоватьСистемныеНастройки Тогда
			
			Сервер       = НастройкаПроксиНаКлиенте.Получить("Сервер");
			Порт         = НастройкаПроксиНаКлиенте.Получить("Порт");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ИспользоватьПрокси Тогда
		ПредставлениеПроксиСервера = НСтр("ru = 'не используется'");
	ИначеЕсли ИспользоватьСистемныеНастройки Тогда
		ПредставлениеПроксиСервера = НСтр("ru = 'используются системные настройки'");
	Иначе
		ПредставлениеПроксиСервера = СтрШаблон(НСтр("ru = '%1:%2'"), Сервер, Формат(Порт, "ЧГ=0"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтображениеДанныхЛокальногоМодуляЧЗ()
	
	ОтображатьДанныеЛокальногоМодуля                      = Не ЕстьПодсистемаГосИС;
	Элементы.ЧестныйЗнак.Видимость                        = ОтображатьДанныеЛокальногоМодуля;
	Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Видимость = Не ОтображатьДанныеЛокальногоМодуля;
	Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Видимость    = Не ОтображатьДанныеЛокальногоМодуля;
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Гиперссылка    = Ложь;
		Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Гиперссылка = Ложь;
		
		АдресПодключенияЛМЧЗ = НСтр("ru = 'запишите настройку подключения ТС ПИоТ'");
		
		Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.ЦветТекста    = ЦветНеактивнойГиперссылки;
		Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.ЦветТекста = ЦветНеактивнойГиперссылки;
		
	Иначе
		
		МодульОбщегоНазначенияИСМП = ОбщегоНазначенияБПО.ОбщийМодуль("ОбщегоНазначенияИСМП");
		ВерсияБГосИСПоддерживаетТокеныПМСР = ЗначениеЗаполнено(ВерсияБГосИС)
			И СтрРазделить(ВерсияБГосИС, ".")[0] = "3"
			И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "3.0.8.1") >= 0
			
			Или ЗначениеЗаполнено(ВерсияБГосИС)
			И СтрРазделить(ВерсияБГосИС, ".")[0] = "2"
			И ОбщегоНазначенияБПОКлиентСервер.СравнитьВерсии(ВерсияБГосИС, "2.0.8.1") >= 0;
		
		Если ПолученыДанныеТСПИоТ И НастройкаЛокальногоМодуляПоДаннымТСПИоТ = Неопределено И Не Объект.Тип = Перечисления.ТипыТСПИоТ.Внутренний1С Тогда
			НастройкиЛокальногоМодуля = МодульОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто);
		ИначеЕсли ВерсияБГосИСПоддерживаетТокеныПМСР Тогда
			НастройкиЛокальногоМодуля = МодульОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто, Объект.Ссылка);
		Иначе
			НастройкиЛокальногоМодуля = МодульОбщегоНазначенияИСМП.НастройкиОсновногоПодключенияЛокальномуМодулюЧестныйЗнакПоОрганизацииРабочемуМесту(Организация, РабочееМесто);
		КонецЕсли;
		
		НастроеноПодключениеЛМЧЗ = НастройкиЛокальногоМодуля.НастроеноПодключение;
		
		Если НастройкиЛокальногоМодуля.НастроеноПодключение Тогда
			
			АдресПодключенияЛМЧЗ      = НастройкиЛокальногоМодуля.Настройки.АдресПодключения;
			НастройкаЛокальногоМодуля = НастройкиЛокальногоМодуля.Настройки;
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Гиперссылка    = Истина;
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Гиперссылка = Истина;
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.ЦветТекста    = Новый Цвет();
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.ЦветТекста = Новый Цвет();
			
		ИначеЕсли ПолученыДанныеТСПИоТ И НастройкаЛокальногоМодуляПоДаннымТСПИоТ <> Неопределено Тогда
			
			МодульНастройкиПодключенияЛМЧЗ = ОбщегоНазначенияБПО.ОбщийМодуль("РегистрыСведений.НастройкиПодключенияЛокальныхМодулейИСМП");
			
			АдресПодключенияЛМЧЗ = МодульНастройкиПодключенияЛМЧЗ.ПредставлениеНастройкиПодключения(
				НастройкаЛокальногоМодуляПоДаннымТСПИоТ.IPАдресУстановки,
				НастройкаЛокальногоМодуляПоДаннымТСПИоТ.ПортУстановки);
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Гиперссылка    = Истина;
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Гиперссылка = Истина;
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.ЦветТекста    = Новый Цвет();
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.ЦветТекста = Новый Цвет();
			
		ИначеЕсли Не ПолученыДанныеТСПИоТ И Не Объект.Тип = Перечисления.ТипыТСПИоТ.Внутренний1С Тогда
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Гиперссылка    = Ложь;
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Гиперссылка = Ложь;
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.ЦветТекста    = ЦветНеактивнойГиперссылки;
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.ЦветТекста = ЦветНеактивнойГиперссылки;
			
			АдресПодключенияЛМЧЗ     = НСтр("ru = 'поиск настроек'");
			
		Иначе
			
			АдресПодключенияЛМЧЗ     = НСтр("ru = 'подключить'");
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.Гиперссылка    = Истина;
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.Гиперссылка = Истина;
			
			Элементы.АдресПодключенияЛМЧЗВнешнийПИоТ.ЦветТекста    = Новый Цвет();
			Элементы.АдресПодключенияЛМЧЗВнутреннийПИоТ.ЦветТекста = Новый Цвет();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыНастройкиПодключенияЛокальногоМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЕстьПодсистемаГосИС Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтображениеДанныхЛокальногоМодуляЧЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияОкнаНастройкаПроксиСервера(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЕстьПодсистемаБСП Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьОтображениеДанныхПрокси();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТекстРасширеннойОшибкиПодключения(ТекстОшибкиГИСМТ)
	
	МассивСтрокПодсказки = Новый Массив;
	МассивСтрокПодсказки.Добавить(НСтр("ru = '1. Проверьте корректность ввода настроек подключения к ТС ПИоТ.'"));
	МассивСтрокПодсказки.Добавить(Символы.ПС);
	МассивСтрокПодсказки.Добавить(НСтр("ru = '2. Установите сертификаты безопасности из папки установки ТС ПИоТа'"));
	МассивСтрокПодсказки.Добавить(" ");
	МассивСтрокПодсказки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = '%ProgramData%\ESP\ESM\UM'"), ШрифтВажногоТекста));
	МассивСтрокПодсказки.Добавить(" ");
	МассивСтрокПодсказки.Добавить(НСтр("ru = 'в список доверенных корневых сертификатов Windows.
									   |Пример названия корневых сертификатов для установки -'"));
	МассивСтрокПодсказки.Добавить(" ");
	МассивСтрокПодсказки.Добавить(Символы.ПС);
	МассивСтрокПодсказки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'ca.crt'"), ШрифтВажногоТекста));
	МассивСтрокПодсказки.Добавить(НСтр("ru = ' и'"));
	МассивСтрокПодсказки.Добавить(" ");
	МассивСтрокПодсказки.Добавить(Новый ФорматированнаяСтрока(НСтр("ru = 'server.crt.'"), ШрифтВажногоТекста));
	МассивСтрокПодсказки.Добавить(Символы.ПС);
	МассивСтрокПодсказки.Добавить(НСтр("ru = 'или'"));
	МассивСтрокПодсказки.Добавить(Символы.ПС);
	МассивСтрокПодсказки.Добавить(НСтр("ru = '2. Установите галку Исключить проверку корневых сертификатов в настройке ТС ПИоТ.'"));
	МассивСтрокПодсказки.Добавить(Символы.ПС);
	
	Если ЗначениеЗаполнено(ТекстОшибкиГИСМТ) Тогда
		МассивСтрокПодсказки.Добавить(Символы.ПС);
		МассивСтрокПодсказки.Добавить(ТекстОшибкиГИСМТ);
	КонецЕсли;
	
	ТекстОшибкиПодключенияТСПИоТ = Новый ФорматированнаяСтрока(МассивСтрокПодсказки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
